JorgeGBeltre/ESP32_MQTTv5/ESP32_MQTTv5.cpp
#include "ESP32_MQTTv5.h"

MQTTProperties::MQTTProperties() : _propCount(0) {}

void MQTTProperties::clear() { _propCount = 0; }

static inline bool _propAdd(MQTTProperties::Property *props, uint8_t &count,
                            uint8_t id, MQTTProperties::PropType type) {
  if (count >= MQTT_MAX_PROPS)
    return false;
  props[count].id = id;
  props[count].dataType = type;
  props[count].num.u32 = 0;
  props[count].str = String();
  props[count].key = String();
  return true;
}

void MQTTProperties::addUserProperty(const String &key, const String &value) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = USER_PROPERTY;
  p.dataType = PTYPE_STR;
  p.str = value;
  p.key = key;
}

void MQTTProperties::setMessageExpiry(uint32_t s) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = MESSAGE_EXPIRY_INTERVAL;
  p.dataType = PTYPE_U32;
  p.num.u32 = s;
}
void MQTTProperties::setContentType(const String &v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = CONTENT_TYPE;
  p.dataType = PTYPE_STR;
  p.str = v;
}
void MQTTProperties::setResponseTopic(const String &v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = RESPONSE_TOPIC;
  p.dataType = PTYPE_STR;
  p.str = v;
}
void MQTTProperties::setCorrelationData(const String &v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = CORRELATION_DATA;
  p.dataType = PTYPE_BIN;
  p.str = v;
}
void MQTTProperties::setCorrelationData(const uint8_t *data, size_t len) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = CORRELATION_DATA;
  p.dataType = PTYPE_BIN;
  p.str = String((const char *)data, len);
}
void MQTTProperties::setSessionExpiry(uint32_t s) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = SESSION_EXPIRY_INTERVAL;
  p.dataType = PTYPE_U32;
  p.num.u32 = s;
}
void MQTTProperties::setWillDelay(uint32_t s) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = WILL_DELAY_INTERVAL;
  p.dataType = PTYPE_U32;
  p.num.u32 = s;
}
void MQTTProperties::setRequestProblemInfo(bool v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = REQUEST_PROBLEM_INFORMATION;
  p.dataType = PTYPE_U8;
  p.num.u8 = v ? 1 : 0;
}
void MQTTProperties::setRequestResponseInfo(bool v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = REQUEST_RESPONSE_INFORMATION;
  p.dataType = PTYPE_U8;
  p.num.u8 = v ? 1 : 0;
}
void MQTTProperties::setReasonString(const String &v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = REASON_STRING;
  p.dataType = PTYPE_STR;
  p.str = v;
}
void MQTTProperties::setPayloadFormat(uint8_t v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = PAYLOAD_FORMAT_INDICATOR;
  p.dataType = PTYPE_U8;
  p.num.u8 = v;
}
void MQTTProperties::setSubscriptionIdentifier(uint32_t v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = SUBSCRIPTION_IDENTIFIER;
  p.dataType = PTYPE_VINT;
  p.num.u32 = v;
}
void MQTTProperties::setAssignedClientId(const String &v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = ASSIGNED_CLIENT_IDENTIFIER;
  p.dataType = PTYPE_STR;
  p.str = v;
}
void MQTTProperties::setAuthenticationMethod(const String &v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = AUTHENTICATION_METHOD;
  p.dataType = PTYPE_STR;
  p.str = v;
}
void MQTTProperties::setAuthenticationData(const uint8_t *data, size_t len) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = AUTHENTICATION_DATA;
  p.dataType = PTYPE_BIN;
  p.str = String((const char *)data, len);
}
void MQTTProperties::setResponseInfo(const String &v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = RESPONSE_INFORMATION;
  p.dataType = PTYPE_STR;
  p.str = v;
}
void MQTTProperties::setServerReference(const String &v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = SERVER_REFERENCE;
  p.dataType = PTYPE_STR;
  p.str = v;
}
void MQTTProperties::setServerKeepAlive(uint16_t v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = SERVER_KEEP_ALIVE;
  p.dataType = PTYPE_U16;
  p.num.u16 = v;
}
void MQTTProperties::setReceiveMaximum(uint16_t v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = RECEIVE_MAXIMUM;
  p.dataType = PTYPE_U16;
  p.num.u16 = v;
}
void MQTTProperties::setTopicAliasMaximum(uint16_t v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = TOPIC_ALIAS_MAXIMUM;
  p.dataType = PTYPE_U16;
  p.num.u16 = v;
}
void MQTTProperties::setTopicAlias(uint16_t v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = TOPIC_ALIAS;
  p.dataType = PTYPE_U16;
  p.num.u16 = v;
}
void MQTTProperties::setMaximumQoS(uint8_t v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = MAXIMUM_QOS;
  p.dataType = PTYPE_U8;
  p.num.u8 = v;
}
void MQTTProperties::setRetainAvailable(bool v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = RETAIN_AVAILABLE;
  p.dataType = PTYPE_U8;
  p.num.u8 = v ? 1 : 0;
}
void MQTTProperties::setWildcardSubscriptionAvailable(bool v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = WILDCARD_SUBSCRIPTION_AVAILABLE;
  p.dataType = PTYPE_U8;
  p.num.u8 = v ? 1 : 0;
}
void MQTTProperties::setSubscriptionIdentifierAvailable(bool v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = SUBSCRIPTION_IDENTIFIER_AVAILABLE;
  p.dataType = PTYPE_U8;
  p.num.u8 = v ? 1 : 0;
}
void MQTTProperties::setSharedSubscriptionAvailable(bool v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = SHARED_SUBSCRIPTION_AVAILABLE;
  p.dataType = PTYPE_U8;
  p.num.u8 = v ? 1 : 0;
}
void MQTTProperties::setMaximumPacketSize(uint32_t v) {
  if (_propCount >= MQTT_MAX_PROPS)
    return;
  Property &p = _props[_propCount++];
  p.id = MAXIMUM_PACKET_SIZE;
  p.dataType = PTYPE_U32;
  p.num.u32 = v;
}

