JorgeGBeltre/ESP32_MQTTv5/ESP32_MQTTv5.cpp
int MQTTProperties::serialize(uint8_t *buf, int bufSize) const {
  int pos = 0;

#define NEED(n)                                                                \
  do {                                                                         \
    if (pos + (n) > bufSize)                                                   \
      return -1;                                                               \
  } while (0)

  for (uint8_t i = 0; i < _propCount; ++i) {
    const Property &prop = _props[i];

    NEED(1);
    buf[pos++] = prop.id;

    switch (prop.dataType) {
    case PTYPE_U8:
      NEED(1);
      buf[pos++] = prop.num.u8;
      break;

    case PTYPE_U16:
      NEED(2);
      buf[pos++] = (prop.num.u16 >> 8) & 0xFF;
      buf[pos++] = prop.num.u16 & 0xFF;
      break;

    case PTYPE_U32:
      NEED(4);
      buf[pos++] = (prop.num.u32 >> 24) & 0xFF;
      buf[pos++] = (prop.num.u32 >> 16) & 0xFF;
      buf[pos++] = (prop.num.u32 >> 8) & 0xFF;
      buf[pos++] = prop.num.u32 & 0xFF;
      break;

    case PTYPE_STR:
    case PTYPE_BIN: {
      if (prop.id == USER_PROPERTY) {

        uint16_t kl = (uint16_t)prop.key.length();
        NEED(2 + kl);
        buf[pos++] = (kl >> 8) & 0xFF;
        buf[pos++] = kl & 0xFF;
        memcpy(&buf[pos], prop.key.c_str(), kl);
        pos += kl;
      }
      uint16_t vl = (uint16_t)prop.str.length();
      NEED(2 + vl);
      buf[pos++] = (vl >> 8) & 0xFF;
      buf[pos++] = vl & 0xFF;
      memcpy(&buf[pos], prop.str.c_str(), vl);
      pos += vl;
      break;
    }

    case PTYPE_VINT: {

      uint32_t val = prop.num.u32;
      do {
        NEED(1);
        uint8_t byte = val & 0x7F;
        val >>= 7;
        if (val > 0)
          byte |= 0x80;
        buf[pos++] = byte;
      } while (val > 0);
      break;
    }
    }
  }

#undef NEED
  return pos;
}

int MQTTProperties::parse(const uint8_t *data, int length) {
  _propCount = 0;
  int pos = 0;

  while (pos < length && _propCount < MQTT_MAX_PROPS) {
    if (pos >= length)
      break;
    uint8_t id = data[pos++];

    Property &prop = _props[_propCount];
    prop.id = id;
    prop.num.u32 = 0;
    prop.str = String();
    prop.key = String();

    switch (id) {

    case PAYLOAD_FORMAT_INDICATOR:
    case REQUEST_PROBLEM_INFORMATION:
    case REQUEST_RESPONSE_INFORMATION:
    case MAXIMUM_QOS:
    case RETAIN_AVAILABLE:
    case WILDCARD_SUBSCRIPTION_AVAILABLE:
    case SUBSCRIPTION_IDENTIFIER_AVAILABLE:
    case SHARED_SUBSCRIPTION_AVAILABLE:
      if (pos >= length)
        goto done;
      prop.dataType = PTYPE_U8;
      prop.num.u8 = data[pos++];
      break;

    case SERVER_KEEP_ALIVE:
    case RECEIVE_MAXIMUM:
    case TOPIC_ALIAS_MAXIMUM:
    case TOPIC_ALIAS:
      if (pos + 2 > length)
        goto done;
      prop.dataType = PTYPE_U16;
      prop.num.u16 = ((uint16_t)data[pos] << 8) | data[pos + 1];
      pos += 2;
      break;

    case MESSAGE_EXPIRY_INTERVAL:
    case SESSION_EXPIRY_INTERVAL:
    case WILL_DELAY_INTERVAL:
    case MAXIMUM_PACKET_SIZE:
      if (pos + 4 > length)
        goto done;
      prop.dataType = PTYPE_U32;
      prop.num.u32 = ((uint32_t)data[pos] << 24) |
                     ((uint32_t)data[pos + 1] << 16) |
                     ((uint32_t)data[pos + 2] << 8) | (uint32_t)data[pos + 3];
      pos += 4;
      break;

    case CONTENT_TYPE:
    case RESPONSE_TOPIC:
    case ASSIGNED_CLIENT_IDENTIFIER:
    case AUTHENTICATION_METHOD:
    case REASON_STRING:
    case RESPONSE_INFORMATION:
    case SERVER_REFERENCE: {
      if (pos + 2 > length)
        goto done;
      uint16_t slen = ((uint16_t)data[pos] << 8) | data[pos + 1];
      pos += 2;
      if (pos + slen > length)
        goto done;
      prop.dataType = PTYPE_STR;
      prop.str = String((const char *)&data[pos], slen);
      pos += slen;
      break;
    }

    case CORRELATION_DATA:
    case AUTHENTICATION_DATA: {
      if (pos + 2 > length)
        goto done;
      uint16_t blen = ((uint16_t)data[pos] << 8) | data[pos + 1];
      pos += 2;
      if (pos + blen > length)
        goto done;
      prop.dataType = PTYPE_BIN;
      prop.str = String((const char *)&data[pos], blen);
      pos += blen;
      break;
    }

    case USER_PROPERTY: {
      if (pos + 2 > length)
        goto done;
      uint16_t kl = ((uint16_t)data[pos] << 8) | data[pos + 1];
      pos += 2;
      if (pos + kl > length)
        goto done;
      prop.key = String((const char *)&data[pos], kl);
      pos += kl;

      if (pos + 2 > length)
        goto done;
      uint16_t vl = ((uint16_t)data[pos] << 8) | data[pos + 1];
      pos += 2;
      if (pos + vl > length)
        goto done;
      prop.dataType = PTYPE_STR;
      prop.str = String((const char *)&data[pos], vl);
      pos += vl;
      break;
    }

    case SUBSCRIPTION_IDENTIFIER: {
      uint32_t val = 0, mult = 1;
      uint8_t digit;
      do {
        if (pos >= length)
          goto done;
        digit = data[pos++];
        val += (digit & 0x7F) * mult;
        mult *= 128;
      } while ((digit & 0x80) && mult <= (128 * 128 * 128));
      prop.dataType = PTYPE_VINT;
      prop.num.u32 = val;
      break;
    }

    default:

      goto done;
    }

    _propCount++;
  }

done:
  return pos;
}

String MQTTProperties::getUserProperty(const String &key) const {
  for (uint8_t i = 0; i < _propCount; ++i)
    if (_props[i].id == USER_PROPERTY && _props[i].key == key)
      return _props[i].str;
  return String();
}

String MQTTProperties::getReasonString() const {
  return getString(REASON_STRING);
}

uint32_t MQTTProperties::getSubscriptionIdentifier() const {
  for (uint8_t i = 0; i < _propCount; ++i)
    if (_props[i].id == SUBSCRIPTION_IDENTIFIER)
      return _props[i].num.u32;
  return 0;
}

uint16_t MQTTProperties::getTopicAlias() const {
  return getUint16(TOPIC_ALIAS, 0);
}

uint8_t MQTTProperties::getPayloadFormat() const {
  return getUint8(PAYLOAD_FORMAT_INDICATOR, 0);
}

uint16_t MQTTProperties::getUint16(uint8_t propId, uint16_t def) const {
  for (uint8_t i = 0; i < _propCount; ++i)
    if (_props[i].id == propId && _props[i].dataType == PTYPE_U16)
      return _props[i].num.u16;
  return def;
}

uint32_t MQTTProperties::getUint32(uint8_t propId, uint32_t def) const {
  for (uint8_t i = 0; i < _propCount; ++i)
    if (_props[i].id == propId &&
        (_props[i].dataType == PTYPE_U32 || _props[i].dataType == PTYPE_VINT))
      return _props[i].num.u32;
  return def;
}

