JorgeGBeltre/ESP32_MQTTv5/ESP32_MQTTv5.cpp
uint8_t MQTTProperties::getUint8(uint8_t propId, uint8_t def) const {
  for (uint8_t i = 0; i < _propCount; ++i)
    if (_props[i].id == propId && _props[i].dataType == PTYPE_U8)
      return _props[i].num.u8;
  return def;
}

String MQTTProperties::getString(uint8_t propId) const {
  for (uint8_t i = 0; i < _propCount; ++i)
    if (_props[i].id == propId &&
        (_props[i].dataType == PTYPE_STR || _props[i].dataType == PTYPE_BIN))
      return _props[i].str;
  return String();
}

ESP32_MQTTv5::ESP32_MQTTv5()
    : _state(STATE_DISCONNECTED), _client(nullptr), _ownClient(false),
      _port(1883), _keepAlive(60), _cleanStart(true), _sessionExpiry(0),
      _hasWill(false), _willQos(0), _willRetain(false), _topicAliasMaximum(0),
      _serverTopicAliasMaximum(0), _outAliasCount(0), _nextAliasId(1),
      _buffer(nullptr), _bufferSize(0),
      _desiredBufferSize(MQTT_DEFAULT_BUFFER_SIZE),
      _allowDynamicBufferResize(true), _readTimeoutMs(2000), _qos2OutCount(0),
      _qos2InCount(0), _autoReconnect(false), _reconnectInitialDelay(1000),
      _reconnectMaxDelay(30000), _currentReconnectDelay(1000),
      _lastReconnectAttempt(0), _lastOutbound(0), _lastInbound(0),
      _nextPacketId(1), _lastReasonCode(SUCCESS), _serverMaxPacketSize(0) {

  for (uint8_t i = 0; i < MQTT_MAX_QOS2_OUT; ++i) {
    _qos2Out[i].active = false;
    _qos2Out[i].pubPacket = nullptr;
    _qos2Out[i].retryCount = 0;
  }
}

ESP32_MQTTv5::~ESP32_MQTTv5() {
  disconnect();
  freeBuffer();
  if (_ownClient && _client) {
    delete _client;
    _client = nullptr;
  }
}

void ESP32_MQTTv5::begin(const char *host, uint16_t port) {
  _host = host;
  _port = port;
  if (!_ownClient || !_client) {
    if (_ownClient && _client)
      delete _client;
    _client = new WiFiClient();
    _ownClient = true;
  }
}

void ESP32_MQTTv5::begin(WiFiClient &client, const char *host, uint16_t port) {
  if (_ownClient && _client) {
    delete _client;
  }
  _client = &client;
  _ownClient = false;
  _host = host;
  _port = port;
}

void ESP32_MQTTv5::setBufferSize(uint16_t size) {
  _desiredBufferSize = (size < 32) ? 32 : size;
}

void ESP32_MQTTv5::setKeepAlive(uint16_t s) { _keepAlive = s; }
void ESP32_MQTTv5::setCleanStart(bool v) { _cleanStart = v; }
void ESP32_MQTTv5::setSessionExpiry(uint32_t s) { _sessionExpiry = s; }
void ESP32_MQTTv5::setTopicAliasMaximum(uint16_t m) { _topicAliasMaximum = m; }

void ESP32_MQTTv5::setWill(const String &topic, const String &payload,
                           uint8_t qos, bool retain, MQTTProperties *props) {
  _hasWill = true;
  _willTopic = topic;
  _willPayload = payload;
  _willQos = qos & 0x03;
  _willRetain = retain;
  _willProps.clear();
  if (props) {
    for (uint8_t i = 0; i < props->count(); ++i) {
      const MQTTProperties::Property &src = props->propAt(i);
      switch (src.id) {
      case WILL_DELAY_INTERVAL:
        _willProps.setWillDelay(src.num.u32);
        break;
      case PAYLOAD_FORMAT_INDICATOR:
        _willProps.setPayloadFormat(src.num.u8);
        break;
      case MESSAGE_EXPIRY_INTERVAL:
        _willProps.setMessageExpiry(src.num.u32);
        break;
      case CONTENT_TYPE:
        _willProps.setContentType(src.str);
        break;
      case RESPONSE_TOPIC:
        _willProps.setResponseTopic(src.str);
        break;
      case CORRELATION_DATA:
        _willProps.setCorrelationData(src.str);
        break;
      case USER_PROPERTY:
        _willProps.addUserProperty(src.key, src.str);
        break;
      default:
        break;
      }
    }
  }
}

void ESP32_MQTTv5::setAutoReconnect(bool enable, uint32_t initDelay,
                                    uint32_t maxDelay) {
  _autoReconnect = enable;
  _reconnectInitialDelay = initDelay;
  _reconnectMaxDelay = maxDelay;
  _currentReconnectDelay = initDelay;
}

bool ESP32_MQTTv5::allocBuffer() {
  if (_buffer && _bufferSize == _desiredBufferSize)
    return true;
  freeBuffer();
  _buffer = (uint8_t *)malloc(_desiredBufferSize);
  if (!_buffer)
    return false;
  _bufferSize = _desiredBufferSize;
  return true;
}

void ESP32_MQTTv5::freeBuffer() {
  if (_buffer) {
    free(_buffer);
    _buffer = nullptr;
    _bufferSize = 0;
  }
}

bool ESP32_MQTTv5::connectTransport() {
  if (!_client)
    return false;
  if (!_client->connected()) {
    if (!_client->connect(_host.c_str(), _port))
      return false;
  }
  return true;
}

void ESP32_MQTTv5::disconnectTransport() {
  if (_client)
    _client->stop();
}

int ESP32_MQTTv5::sendPacket(const uint8_t *packet, int length) {
  if (!_client || !_client->connected())
    return 0;
  int sent = _client->write(packet, length);
  if (sent > 0)
    _lastOutbound = millis();
  return sent;
}

int ESP32_MQTTv5::readByte() {
  if (!_client || !_client->connected())
    return -1;
  int b = _client->read();
  if (b != -1)
    _lastInbound = millis();
  return b;
}

int ESP32_MQTTv5::readBytes(uint8_t *buf, int len) {
  if (!_client || !_client->connected())
    return 0;

  unsigned long deadline = millis() + _readTimeoutMs;
  int got = 0;
  while (got < len) {
    if (millis() >= deadline)
      break;
    if (_client->available()) {
      buf[got++] = (uint8_t)_client->read();
      deadline = millis() + _readTimeoutMs;
    } else {
      delay(0);
    }
  }
  if (got > 0)
    _lastInbound = millis();
  return got;
}

uint16_t ESP32_MQTTv5::getNextPacketId() {
  if (++_nextPacketId == 0)
    _nextPacketId = 1;
  return _nextPacketId;
}

int ESP32_MQTTv5::encodeLength(uint8_t *buf, uint32_t value) {
  int bytes = 0;
  do {
    uint8_t byte = value & 0x7F;
    value >>= 7;
    if (value > 0)
      byte |= 0x80;
    if (buf)
      buf[bytes] = byte;
    bytes++;
  } while (value > 0 && bytes < 4);
  return bytes;
}

int ESP32_MQTTv5::decodeLength(const uint8_t *buf, int &value) {
  int bytes = 0, multiplier = 1;
  value = 0;
  uint8_t digit;
  do {
    digit = buf[bytes++];
    value += (digit & 0x7F) * multiplier;
    multiplier *= 128;
  } while ((digit & 0x80) && bytes < 4);
  return bytes;
}

void ESP32_MQTTv5::notifyError(MQTTReasonCode code, const String &msg) {
  _lastReasonCode = code;
  _lastReasonString = msg;
  if (_errorCallback)
    _errorCallback(code, msg);
}

void ESP32_MQTTv5::resetSession() {
  _outAliasCount = 0;
  _nextAliasId = 1;
  _serverTopicAliasMaximum = 0;
  _serverMaxPacketSize = 0;
  _qos2InCount = 0;

  for (uint8_t i = 0; i < _qos2OutCount; ++i) {
    if (_qos2Out[i].pubPacket) {
      free(_qos2Out[i].pubPacket);
      _qos2Out[i].pubPacket = nullptr;
    }
  }
  _qos2OutCount = 0;
  for (uint8_t i = 0; i < MQTT_MAX_ALIASES; ++i)
    _inAliasTopics[i] = String();
}

void ESP32_MQTTv5::onConnect(std::function<void()> cb) {
  _connectCallback = cb;
}
void ESP32_MQTTv5::onDisconnect(std::function<void(MQTTReasonCode)> cb) {
  _disconnectCallback = cb;
}
void ESP32_MQTTv5::onMessage(std::function<void(const MQTTMessage &)> cb) {
  _messageCallback = cb;
}
void ESP32_MQTTv5::onError(
    std::function<void(MQTTReasonCode, const String &)> cb) {
  _errorCallback = cb;
}
void ESP32_MQTTv5::onAuth(
    std::function<void(MQTTReasonCode, const MQTTProperties &)> cb) {
  _authCallback = cb;
}
void ESP32_MQTTv5::onMessageRaw(
    std::function<void(const String &, const uint8_t *, size_t, uint8_t, bool)>
        cb) {
  _messageRawCallback = cb;
}

int ESP32_MQTTv5::buildConnect(uint8_t *buf, int bufSize,
                               MQTTProperties *extraProps) {
  int pos = 0;

#define BC_NEED(n)                                                             \
  do {                                                                         \
    if (pos + (n) > bufSize)                                                   \
      return -1;                                                               \
  } while (0)

  BC_NEED(6);
  buf[pos++] = 0x00;
  buf[pos++] = 0x04;
  buf[pos++] = 'M';
  buf[pos++] = 'Q';
  buf[pos++] = 'T';
  buf[pos++] = 'T';

