JorgeGBeltre/ESP32_MQTTv5/ESP32_MQTTv5.cpp
  BC_NEED(1);
  buf[pos++] = 0x05;

  uint8_t flags = 0;
  if (_cleanStart)
    flags |= 0x02;
  if (_hasWill) {
    flags |= 0x04;
    flags |= ((_willQos & 0x03) << 3);
    if (_willRetain)
      flags |= 0x20;
  }
  if (_username.length() > 0)
    flags |= 0x80;
  if (_password.length() > 0)
    flags |= 0x40;
  BC_NEED(1);
  buf[pos++] = flags;

  BC_NEED(2);
  buf[pos++] = (_keepAlive >> 8) & 0xFF;
  buf[pos++] = _keepAlive & 0xFF;

  MQTTProperties connectProps;
  if (_sessionExpiry > 0)
    connectProps.setSessionExpiry(_sessionExpiry);
  if (_topicAliasMaximum > 0)
    connectProps.setTopicAliasMaximum(_topicAliasMaximum);

  if (extraProps) {
    for (uint8_t i = 0; i < extraProps->count(); ++i) {
      const MQTTProperties::Property &p = extraProps->propAt(i);
      if (p.id == USER_PROPERTY) {
        connectProps.addUserProperty(p.key, p.str);
      } else {

        switch (p.id) {
        case AUTHENTICATION_METHOD:
          connectProps.setAuthenticationMethod(p.str);
          break;
        case REQUEST_RESPONSE_INFORMATION: /* read-only / server sets */
          break;
        case REQUEST_PROBLEM_INFORMATION: /* read-only */
          break;
        default:
          break;
        }
      }
    }
  }

  uint8_t cpBuf[512];
  int cpLen = connectProps.serialize(cpBuf, sizeof(cpBuf));
  if (cpLen < 0)
    return -1;

  int encCp = encodeLength(&buf[pos], (uint32_t)cpLen);
  BC_NEED(encCp + cpLen);
  pos += encCp;
  if (cpLen > 0) {
    memcpy(&buf[pos], cpBuf, cpLen);
    pos += cpLen;
  }

  uint16_t cidLen = (uint16_t)_clientId.length();
  BC_NEED(2 + cidLen);
  buf[pos++] = (cidLen >> 8) & 0xFF;
  buf[pos++] = cidLen & 0xFF;
  memcpy(&buf[pos], _clientId.c_str(), cidLen);
  pos += cidLen;

  if (_hasWill) {

    uint8_t wpBuf[256];
    int wpLen = _willProps.serialize(wpBuf, sizeof(wpBuf));
    if (wpLen < 0)
      return -1;
    int encWp = encodeLength(&buf[pos], (uint32_t)wpLen);
    BC_NEED(encWp + wpLen);
    pos += encWp;
    if (wpLen > 0) {
      memcpy(&buf[pos], wpBuf, wpLen);
      pos += wpLen;
    }

    uint16_t wtLen = (uint16_t)_willTopic.length();
    BC_NEED(2 + wtLen);
    buf[pos++] = (wtLen >> 8) & 0xFF;
    buf[pos++] = wtLen & 0xFF;
    memcpy(&buf[pos], _willTopic.c_str(), wtLen);
    pos += wtLen;

    uint16_t wpayLen = (uint16_t)_willPayload.length();
    BC_NEED(2 + wpayLen);
    buf[pos++] = (wpayLen >> 8) & 0xFF;
    buf[pos++] = wpayLen & 0xFF;
    memcpy(&buf[pos], _willPayload.c_str(), wpayLen);
    pos += wpayLen;
  }

  if (_username.length() > 0) {
    uint16_t ul = (uint16_t)_username.length();
    BC_NEED(2 + ul);
    buf[pos++] = (ul >> 8) & 0xFF;
    buf[pos++] = ul & 0xFF;
    memcpy(&buf[pos], _username.c_str(), ul);
    pos += ul;
  }

  if (_password.length() > 0) {
    uint16_t pl = (uint16_t)_password.length();
    BC_NEED(2 + pl);
    buf[pos++] = (pl >> 8) & 0xFF;
    buf[pos++] = pl & 0xFF;
    memcpy(&buf[pos], _password.c_str(), pl);
    pos += pl;
  }

#undef BC_NEED
  return pos;
}

bool ESP32_MQTTv5::connect(const String &clientId) {
  return connect(clientId, "", "", nullptr);
}

bool ESP32_MQTTv5::connect(const String &clientId, const String &username,
                           const String &password) {
  return connect(clientId, username, password, nullptr);
}

bool ESP32_MQTTv5::connect(const String &clientId, const String &username,
                           const String &password, MQTTProperties *extraProps) {
  if (_state != STATE_DISCONNECTED)
    disconnect();

  _clientId = clientId;
  _username = username;
  _password = password;
  _state = STATE_CONNECTING;
  _lastReconnectAttempt = millis();

  if (!allocBuffer()) {
    _state = STATE_DISCONNECTED;
    notifyError(UNSPECIFIED_ERROR, "Buffer alloc failed");
    return false;
  }

  if (!connectTransport()) {
    _state = STATE_DISCONNECTED;
    notifyError(SERVER_UNAVAILABLE, "Transport failed");
    return false;
  }

  int bodyLen = buildConnect(_buffer + 5, _bufferSize - 5, extraProps);
  if (bodyLen < 0) {
    disconnect();
    notifyError(PACKET_TOO_LARGE, "CONNECT too large; call setBufferSize()");
    return false;
  }

  _buffer[0] = MQTT_CONNECT;
  int encLen = encodeLength(&_buffer[1], (uint32_t)bodyLen);

  int bodyOff = 1 + encLen;
  if (bodyOff != 5)
    memmove(&_buffer[bodyOff], &_buffer[5], bodyLen);
  int totalLen = bodyOff + bodyLen;

  if (sendPacket(_buffer, totalLen) != totalLen) {
    disconnect();
    notifyError(UNSPECIFIED_ERROR, "Send CONNECT failed");
    return false;
  }

  unsigned long timeout = millis() + 5000;
  while (millis() < timeout) {
    if (!_client->available()) {
      delay(10);
      continue;
    }

    int hdr = readByte();
    if (hdr < 0)
      continue;
    uint8_t ptype = (uint8_t)hdr & 0xF0;

    uint8_t lenBuf[4];
    int lenBytes = 0;
    do {
      int b = readByte();
      if (b < 0)
        break;
      lenBuf[lenBytes] = (uint8_t)b;
    } while ((lenBuf[lenBytes++] & 0x80) && lenBytes < 4);
    int remLen;
    decodeLength(lenBuf, remLen);

    if (remLen < 0 || remLen > _bufferSize) {

      for (int i = 0; i < remLen && i < 4096; ++i)
        readByte();
      continue;
    }
    if (remLen > 0)
      readBytes(_buffer, remLen);

    if (ptype == MQTT_AUTH) {
      MQTTReasonCode authReason =
          (remLen >= 1) ? (MQTTReasonCode)_buffer[0] : SUCCESS;
      MQTTProperties authProps;
      if (remLen > 1) {
        int pLen;
        int enc = decodeLength(&_buffer[1], pLen);
        if (pLen > 0)
          authProps.parse(&_buffer[1 + enc], pLen);
      }
      if (_authCallback)
        _authCallback(authReason, authProps);
      timeout = millis() + 5000;
      continue;
    }

    if (ptype != MQTT_CONNACK)
      continue;

    if (remLen < 2) {
      disconnect();
      notifyError(MALFORMED_PACKET, "Short CONNACK");
      return false;
    }

    uint8_t reasonCode = _buffer[1];
    _lastReasonCode = (MQTTReasonCode)reasonCode;

    if (remLen > 2) {
      int pLen;
      int enc = decodeLength(&_buffer[2], pLen);
      if (pLen > 0) {
        MQTTProperties props;
        props.parse(&_buffer[2 + enc], pLen);
        _lastReasonString = props.getReasonString();
        _serverTopicAliasMaximum = props.getUint16(TOPIC_ALIAS_MAXIMUM, 0);
        _serverMaxPacketSize = props.getUint32(MAXIMUM_PACKET_SIZE, 0);

        if (_serverMaxPacketSize > 0 && _serverMaxPacketSize > _bufferSize) {
          uint16_t newSz =
              (uint16_t)(_serverMaxPacketSize > 65535 ? 65535
                                                      : _serverMaxPacketSize);
          _desiredBufferSize = newSz;
          if (!allocBuffer()) {
            notifyError(UNSPECIFIED_ERROR,
                        "Auto buffer resize failed after CONNACK");
          }
        }

        if (_serverTopicAliasMaximum > MQTT_MAX_ALIASES) {
          notifyError(UNSPECIFIED_ERROR, "Server TopicAliasMaximum (" +
                                             String(_serverTopicAliasMaximum) +
                                             ") > MQTT_MAX_ALIASES (" +
                                             String(MQTT_MAX_ALIASES) +
                                             "). Clamped.");
          _serverTopicAliasMaximum = MQTT_MAX_ALIASES;
        }
      }
    }

