JorgeGBeltre/ESP32_MQTTv5/ESP32_MQTTv5.cpp
    if (reasonCode == SUCCESS) {
      _state = STATE_CONNECTED;
      _lastInbound = _lastOutbound = millis();
      resetSession();
      if (_connectCallback)
        _connectCallback();
      return true;
    } else {
      char buf[40];
      if (_lastReasonString.length())
        snprintf(buf, sizeof(buf), "CONNACK 0x%02X: %.24s", reasonCode,
                 _lastReasonString.c_str());
      else
        snprintf(buf, sizeof(buf), "CONNACK 0x%02X", reasonCode);
      disconnect();
      notifyError(_lastReasonCode, String(buf));
      return false;
    }
  }

  disconnect();
  notifyError(SERVER_UNAVAILABLE, "CONNACK timeout");
  return false;
}

void ESP32_MQTTv5::disconnect(MQTTReasonCode reason) {
  if (_state == STATE_CONNECTED) {
    _state = STATE_DISCONNECTING;
    uint8_t disc[4] = {MQTT_DISCONNECT, 0x02, (uint8_t)reason, 0x00};
    sendPacket(disc, 4);
  }
  disconnectTransport();
  _state = STATE_DISCONNECTED;
  if (_disconnectCallback)
    _disconnectCallback(reason);
}

bool ESP32_MQTTv5::connected() {
  return _state == STATE_CONNECTED && _client && _client->connected();
}

void ESP32_MQTTv5::loop() {
  if (_state == STATE_CONNECTED) {

    if (!_client || !_client->connected()) {
      _state = STATE_DISCONNECTED;
      if (_disconnectCallback)
        _disconnectCallback(UNSPECIFIED_ERROR);
    } else {
      parseIncoming();
      retransmitQoS2();

      unsigned long now = millis();

      if (_keepAlive > 0 &&
          (now - _lastOutbound) > (unsigned long)_keepAlive * 1000UL) {
        uint8_t ping[2] = {MQTT_PINGREQ, 0x00};
        sendPacket(ping, 2);
      }

      if (_keepAlive > 0 &&
          (now - _lastInbound) > (unsigned long)_keepAlive * 1500UL) {
        disconnect(KEEP_ALIVE_TIMEOUT);
      }
    }
  }

  if (_autoReconnect && _state == STATE_DISCONNECTED && _client) {
    unsigned long now = millis();
    if ((now - _lastReconnectAttempt) >= _currentReconnectDelay) {
      _lastReconnectAttempt = now;
      if (connect(_clientId, _username, _password)) {
        _currentReconnectDelay = _reconnectInitialDelay;
      } else {

        _currentReconnectDelay =
            (_currentReconnectDelay * 2 > _reconnectMaxDelay)
                ? _reconnectMaxDelay
                : _currentReconnectDelay * 2;
      }
    }
  }
}

uint16_t ESP32_MQTTv5::findOrAssignOutAlias(const String &topic,
                                            bool &sendTopicName) {
  if (_serverTopicAliasMaximum == 0) {
    sendTopicName = true;
    return 0;
  }

  for (uint8_t i = 0; i < _outAliasCount; ++i) {
    if (_outAliases[i].topic == topic) {
      sendTopicName = false;
      return _outAliases[i].alias;
    }
  }

  if (_outAliasCount < MQTT_MAX_ALIASES &&
      _nextAliasId <= _serverTopicAliasMaximum) {
    uint16_t alias = _nextAliasId++;
    _outAliases[_outAliasCount].topic = topic;
    _outAliases[_outAliasCount].alias = alias;
    ++_outAliasCount;
    sendTopicName = true;
    return alias;
  }

  sendTopicName = true;
  return 0;
}

String ESP32_MQTTv5::resolveInAlias(uint16_t alias,
                                    const String &topicInPacket) {
  if (alias == 0 || alias > MQTT_MAX_ALIASES)
    return topicInPacket;
  uint8_t idx = alias - 1;
  if (topicInPacket.length() > 0) {
    _inAliasTopics[idx] = topicInPacket;
  }
  return (_inAliasTopics[idx].length() > 0) ? _inAliasTopics[idx]
                                            : topicInPacket;
}

bool ESP32_MQTTv5::addQoS2Out(uint16_t packetId, const uint8_t *packet,
                              int len) {
  if (_qos2OutCount >= MQTT_MAX_QOS2_OUT)
    return false;
  QoS2OutEntry &e = _qos2Out[_qos2OutCount++];
  e.packetId = packetId;
  e.lastTxMs = millis();
  e.pubrelSent = false;
  e.active = true;
  e.retryCount = 0;
  e.pubPacket = nullptr;
  e.pubPacketLen = 0;
  if (packet && len > 0) {
    e.pubPacket = (uint8_t *)malloc(len);
    if (e.pubPacket) {
      memcpy(e.pubPacket, packet, len);
      e.pubPacketLen = (uint16_t)len;
    }
  }
  return true;
}

void ESP32_MQTTv5::freeQoS2Out(uint8_t index) {
  if (_qos2Out[index].pubPacket) {
    free(_qos2Out[index].pubPacket);
    _qos2Out[index].pubPacket = nullptr;
  }
  _qos2Out[index] = _qos2Out[--_qos2OutCount];
}

void ESP32_MQTTv5::handlePubrec(uint16_t packetId) {
  for (uint8_t i = 0; i < _qos2OutCount; ++i) {
    if (_qos2Out[i].active && _qos2Out[i].packetId == packetId) {

      if (_qos2Out[i].pubPacket) {
        free(_qos2Out[i].pubPacket);
        _qos2Out[i].pubPacket = nullptr;
      }
      _qos2Out[i].retryCount = 0;
      uint8_t pubrel[4] = {(uint8_t)(MQTT_PUBREL | 0x02), 0x02,
                           (uint8_t)(packetId >> 8),
                           (uint8_t)(packetId & 0xFF)};
      sendPacket(pubrel, 4);
      _qos2Out[i].pubrelSent = true;
      _qos2Out[i].lastTxMs = millis();
      return;
    }
  }
}

void ESP32_MQTTv5::handlePubcomp(uint16_t packetId) {
  for (uint8_t i = 0; i < _qos2OutCount; ++i) {
    if (_qos2Out[i].active && _qos2Out[i].packetId == packetId) {
      freeQoS2Out(i);
      return;
    }
  }
}

void ESP32_MQTTv5::retransmitQoS2() {
  unsigned long now = millis();
  for (uint8_t i = 0; i < _qos2OutCount;) {
    QoS2OutEntry &e = _qos2Out[i];
    if (!e.active) {
      ++i;
      continue;
    }

    if ((now - e.lastTxMs) >= MQTT_QOS2_RETRY_MS) {
      if (e.pubrelSent) {

        uint8_t pubrel[4] = {(uint8_t)(MQTT_PUBREL | 0x02), 0x02,
                             (uint8_t)(e.packetId >> 8),
                             (uint8_t)(e.packetId & 0xFF)};
        sendPacket(pubrel, 4);
        e.lastTxMs = now;
        ++i;
      } else {

        if (e.pubPacket && e.pubPacketLen > 0) {
          if (e.retryCount < MQTT_QOS2_MAX_RETRIES) {
            e.pubPacket[0] |= 0x08;
            sendPacket(e.pubPacket, e.pubPacketLen);
            e.lastTxMs = now;
            e.retryCount++;
            ++i;
          } else {

            notifyError(UNSPECIFIED_ERROR,
                        "QoS2 packetId " + String(e.packetId) +
                            " abandoned after " +
                            String(MQTT_QOS2_MAX_RETRIES) + " retransmits");
            freeQoS2Out(i);
          }
        } else {
          ++i;
        }
      }
    } else {
      ++i;
    }
  }
}

bool ESP32_MQTTv5::isQoS2InFlight(uint16_t packetId) const {
  for (uint8_t i = 0; i < _qos2InCount; ++i)
    if (_qos2In[i] == packetId)
      return true;
  return false;
}

