JorgeGBeltre/ESP32_MQTTv5/ESP32_MQTTv5.cpp
void ESP32_MQTTv5::addQoS2In(uint16_t packetId) {
  if (_qos2InCount < MQTT_MAX_QOS2_IN)
    _qos2In[_qos2InCount++] = packetId;
}

void ESP32_MQTTv5::removeQoS2In(uint16_t packetId) {
  for (uint8_t i = 0; i < _qos2InCount; ++i) {
    if (_qos2In[i] == packetId) {
      _qos2In[i] = _qos2In[--_qos2InCount];
      return;
    }
  }
}

bool ESP32_MQTTv5::parseIncoming() {
  if (!_client || !_buffer)
    return false;

  while (_client->available()) {
    int hdrByte = readByte();
    if (hdrByte < 0)
      break;
    uint8_t header = (uint8_t)hdrByte;
    uint8_t ptype = header & 0xF0;

    uint8_t lenBuf[4];
    int lenBytes = 0;
    unsigned long lenDeadline = millis() + _readTimeoutMs;
    do {
      int b = -1;
      while (millis() < lenDeadline && b < 0) {
        if (_client->available())
          b = _client->read();
        else
          delay(0);
      }
      if (b < 0) {
        notifyError(MALFORMED_PACKET, "Timeout reading packet length");
        return false;
      }
      lenBuf[lenBytes] = (uint8_t)b;
    } while ((lenBuf[lenBytes++] & 0x80) && lenBytes < 4);
    int remLen;
    decodeLength(lenBuf, remLen);

    if (remLen < 0) {
      notifyError(MALFORMED_PACKET, "Bad remaining length");
      return false;
    }

    if ((int)remLen > _bufferSize) {
      if (_allowDynamicBufferResize) {
        int newSize = remLen + 512;
        if (newSize > 65535)
          newSize = 65535;
        _desiredBufferSize = (uint16_t)newSize;
        if (!allocBuffer()) {
          int drain = remLen;
          while (drain > 0) {
            uint8_t tmp[64];
            int rd = (drain < (int)sizeof(tmp)) ? drain : (int)sizeof(tmp);
            readBytes(tmp, rd);
            drain -= rd;
          }
          notifyError(UNSPECIFIED_ERROR, "Dynamic buffer resize failed");
          return true;
        }

      } else {
        int drain = remLen;
        while (drain > 0) {
          int chunk = (drain < _bufferSize) ? drain : _bufferSize;
          readBytes(_buffer, chunk);
          drain -= chunk;
        }
        notifyError(PACKET_TOO_LARGE, "Incoming packet exceeds buffer");
        return true;
      }
    }

    if (remLen > 0) {
      int got = readBytes(_buffer, remLen);
      if (got != remLen) {
        notifyError(MALFORMED_PACKET, "Incomplete packet");
        return false;
      }
    }

    switch (ptype) {

    case MQTT_PUBLISH: {
      int pos = 0;
      if (pos + 2 > remLen)
        break;
      uint16_t topicLen = ((uint16_t)_buffer[pos] << 8) | _buffer[pos + 1];
      pos += 2;
      if (pos + topicLen > remLen) {
        notifyError(MALFORMED_PACKET, "Topic overflow");
        break;
      }
      String topic = String((const char *)&_buffer[pos], topicLen);
      pos += topicLen;

      uint8_t qos = (header >> 1) & 0x03;
      bool retain = (header & 0x01) != 0;
      uint16_t packetId = 0;
      if (qos > 0) {
        if (pos + 2 > remLen)
          break;
        packetId = ((uint16_t)_buffer[pos] << 8) | _buffer[pos + 1];
        pos += 2;
      }

      if (pos >= remLen)
        break;
      int propLen;
      int encProp = decodeLength(&_buffer[pos], propLen);
      pos += encProp;
      MQTTProperties props;
      if (propLen > 0) {
        props.parse(&_buffer[pos], propLen);
        pos += propLen;
      }

      uint16_t alias = props.getTopicAlias();
      topic = resolveInAlias(alias, topic);

      bool isDup = (qos == 2) && isQoS2InFlight(packetId);
      int payloadLen = remLen - pos;

      if (qos == 1) {
        uint8_t ack[4] = {MQTT_PUBACK, 0x02, (uint8_t)(packetId >> 8),
                          (uint8_t)(packetId & 0xFF)};
        sendPacket(ack, 4);
      } else if (qos == 2) {
        uint8_t pubrec[4] = {MQTT_PUBREC, 0x02, (uint8_t)(packetId >> 8),
                             (uint8_t)(packetId & 0xFF)};
        sendPacket(pubrec, 4);
        if (!isDup)
          addQoS2In(packetId);
      }

      if (!isDup) {
        if (_messageRawCallback) {
          _messageRawCallback(topic, &_buffer[pos], (size_t)payloadLen, qos,
                              retain);
        } else if (_messageCallback) {
          MQTTMessage msg;
          msg.topic = topic;
          msg.payload = String((const char *)&_buffer[pos], payloadLen);
          msg.qos = qos;
          msg.retain = retain;
          msg.hasTopicAlias = (alias > 0);
          msg.topicAlias = alias;
          msg.payloadFormatIndicator = props.getPayloadFormat();
          msg.hasPayloadFormatIndicator =
              (props.getUint8(PAYLOAD_FORMAT_INDICATOR, 0xFF) != 0xFF);
          msg.messageExpiry = props.getUint32(MESSAGE_EXPIRY_INTERVAL, 0);
          msg.contentType = props.getString(CONTENT_TYPE);
          msg.responseTopic = props.getString(RESPONSE_TOPIC);
          msg.correlationData = props.getString(CORRELATION_DATA);
          msg.subscriptionIdentifier = props.getSubscriptionIdentifier();
          msg.hasSubscriptionIdentifier = (msg.subscriptionIdentifier > 0);
          _messageCallback(msg);
        }
      }
      break;
    }

    case MQTT_PUBACK:
      break;

    case MQTT_PUBREC: {
      if (remLen >= 2) {
        uint16_t pid = ((uint16_t)_buffer[0] << 8) | _buffer[1];
        handlePubrec(pid);
      }
      break;
    }

    case MQTT_PUBREL: {
      if (remLen >= 2) {
        uint16_t pid = ((uint16_t)_buffer[0] << 8) | _buffer[1];
        removeQoS2In(pid);
        uint8_t pubcomp[4] = {MQTT_PUBCOMP, 0x02, (uint8_t)(pid >> 8),
                              (uint8_t)(pid & 0xFF)};
        sendPacket(pubcomp, 4);
      }
      break;
    }

    case MQTT_PUBCOMP: {
      if (remLen >= 2) {
        uint16_t pid = ((uint16_t)_buffer[0] << 8) | _buffer[1];
        handlePubcomp(pid);
      }
      break;
    }

    case MQTT_SUBACK:
    case MQTT_UNSUBACK:
    case MQTT_PINGRESP:
      break;

    case MQTT_AUTH: {
      MQTTReasonCode authReason =
          (remLen >= 1) ? (MQTTReasonCode)_buffer[0] : SUCCESS;
      MQTTProperties authProps;
      if (remLen > 1) {
        int pLen;
        int enc = decodeLength(&_buffer[1], pLen);
        if (pLen > 0)
          authProps.parse(&_buffer[1 + enc], pLen);
      }
      if (_authCallback)
        _authCallback(authReason, authProps);
      break;
    }

    case MQTT_DISCONNECT: {
      MQTTReasonCode rc =
          (remLen >= 1) ? (MQTTReasonCode)_buffer[0] : NORMAL_DISCONNECTION;
      _lastReasonCode = rc;
      if (remLen > 1) {
        int pLen;
        int enc = decodeLength(&_buffer[1], pLen);
        if (pLen > 0) {
          MQTTProperties dp;
          dp.parse(&_buffer[1 + enc], pLen);
          _lastReasonString = dp.getReasonString();
        }
      }
      disconnectTransport();
      _state = STATE_DISCONNECTED;
      if (_disconnectCallback)
        _disconnectCallback(rc);
      return true;
    }

    default:
      break;
    }
  }
  return true;
}

bool ESP32_MQTTv5::publish(const String &topic, const String &payload) {
  return publish(topic, payload, 0, false, nullptr);
}
bool ESP32_MQTTv5::publish(const String &topic, const String &payload,
                           uint8_t qos) {
  return publish(topic, payload, qos, false, nullptr);
}
bool ESP32_MQTTv5::publish(const String &topic, const String &payload,
                           MQTTProperties &props) {
  return publish(topic, payload, 0, false, &props);
}

bool ESP32_MQTTv5::publish(const String &topic, const String &payload,
                           uint8_t qos, bool retain, MQTTProperties *props) {
  if (!connected())
    return false;
  if (qos > 2)
    qos = 2;

