JorgeGBeltre/ESP32_MQTTv5/ESP32_MQTTv5.cpp
  size_t estimatedMax = 5 + topic.length() + 2 + 256 + payload.length();
  if (estimatedMax > _bufferSize) {
    notifyError(PACKET_TOO_LARGE,
                "Payload too large for buffer; call setBufferSize()");
    return false;
  }

  bool sendTopicName = true;
  uint16_t useAlias = findOrAssignOutAlias(topic, sendTopicName);

  MQTTProperties pubProps;
  if (props) {
    for (uint8_t i = 0; i < props->count(); ++i) {
      const MQTTProperties::Property &p = props->propAt(i);
      switch (p.id) {
      case USER_PROPERTY:
        pubProps.addUserProperty(p.key, p.str);
        break;
      case MESSAGE_EXPIRY_INTERVAL:
        pubProps.setMessageExpiry(p.num.u32);
        break;
      case CONTENT_TYPE:
        pubProps.setContentType(p.str);
        break;
      case RESPONSE_TOPIC:
        pubProps.setResponseTopic(p.str);
        break;
      case CORRELATION_DATA:
        pubProps.setCorrelationData(p.str);
        break;
      case PAYLOAD_FORMAT_INDICATOR:
        pubProps.setPayloadFormat(p.num.u8);
        break;
      default:
        break;
      }
    }
  }
  if (useAlias > 0)
    pubProps.setTopicAlias(useAlias);

  uint8_t propBuf[256];
  int propLen = pubProps.serialize(propBuf, sizeof(propBuf));
  if (propLen < 0) {
    notifyError(PACKET_TOO_LARGE, "PUBLISH properties too large");
    return false;
  }

  uint8_t *body = _buffer + 5;
  int bodyMax = _bufferSize - 5;
  int bpos = 0;

#define PB_NEED(n)                                                             \
  do {                                                                         \
    if (bpos + (n) > bodyMax) {                                                \
      notifyError(PACKET_TOO_LARGE, "PUBLISH overflow");                       \
      return false;                                                            \
    }                                                                          \
  } while (0)

  const String &topicToSend = sendTopicName ? topic : String("");
  uint16_t tl = (uint16_t)topicToSend.length();
  PB_NEED(2 + tl);
  body[bpos++] = (tl >> 8) & 0xFF;
  body[bpos++] = tl & 0xFF;
  if (tl > 0) {
    memcpy(&body[bpos], topicToSend.c_str(), tl);
    bpos += tl;
  }

  uint16_t packetId = 0;
  if (qos > 0) {
    packetId = getNextPacketId();
    PB_NEED(2);
    body[bpos++] = (packetId >> 8) & 0xFF;
    body[bpos++] = packetId & 0xFF;
  }

  int encProp = encodeLength(&body[bpos], (uint32_t)propLen);
  PB_NEED(encProp + propLen);
  bpos += encProp;
  if (propLen > 0) {
    memcpy(&body[bpos], propBuf, propLen);
    bpos += propLen;
  }

  uint32_t pl = (uint32_t)payload.length();
  PB_NEED((int)pl);
  memcpy(&body[bpos], payload.c_str(), pl);
  bpos += (int)pl;

#undef PB_NEED

  _buffer[0] = MQTT_PUBLISH | ((qos & 0x03) << 1) | (retain ? 0x01 : 0x00);
  int encLen = encodeLength(&_buffer[1], (uint32_t)bpos);
  int bodyOff = 1 + encLen;
  if (bodyOff != 5)
    memmove(&_buffer[bodyOff], &_buffer[5], bpos);

  if (bpos < 0) {
    notifyError(UNSPECIFIED_ERROR, "PUBLISH body length underflow");
    return false;
  }
  uint32_t totalLen = (uint32_t)(bodyOff + bpos);

  if (_serverMaxPacketSize > 0 && totalLen > _serverMaxPacketSize) {
    notifyError(PACKET_TOO_LARGE, "Exceeds server maximum packet size");
    return false;
  }

  if (sendPacket(_buffer, (int)totalLen) != (int)totalLen)
    return false;

  if (qos == 2)
    addQoS2Out(packetId, _buffer, (int)totalLen);
  return true;
}

bool ESP32_MQTTv5::subscribe(const String &topic) {
  return subscribe(topic, 0, false, false, 0);
}
bool ESP32_MQTTv5::subscribe(const String &topic, uint8_t qos) {
  return subscribe(topic, qos, false, false, 0);
}

bool ESP32_MQTTv5::subscribe(const String &topic, uint8_t qos, bool noLocal,
                             bool retainAsPublished, uint8_t retainHandling,
                             uint32_t subId) {
  if (!connected())
    return false;
  if ((size_t)topic.length() > _bufferSize - 20)
    return false;

  uint8_t *body = _buffer + 5;
  int bodyMax = _bufferSize - 5;
  int bpos = 0;

  uint16_t packetId = getNextPacketId();
  body[bpos++] = (packetId >> 8) & 0xFF;
  body[bpos++] = packetId & 0xFF;

  if (subId > 0) {

    MQTTProperties subProps;
    subProps.setSubscriptionIdentifier(subId);
    uint8_t spBuf[8];
    int spLen = subProps.serialize(spBuf, sizeof(spBuf));
    if (spLen < 0 ||
        bpos + encodeLength(nullptr, (uint32_t)spLen) + spLen > bodyMax)
      return false;
    int encSp = encodeLength(&body[bpos], (uint32_t)spLen);
    bpos += encSp;
    memcpy(&body[bpos], spBuf, spLen);
    bpos += spLen;
  } else {
    body[bpos++] = 0x00;
  }

  uint16_t tl = (uint16_t)topic.length();
  if (bpos + 2 + tl + 1 > bodyMax)
    return false;
  body[bpos++] = (tl >> 8) & 0xFF;
  body[bpos++] = tl & 0xFF;
  memcpy(&body[bpos], topic.c_str(), tl);
  bpos += tl;

  uint8_t opts = (qos & 0x03);
  if (noLocal)
    opts |= 0x04;
  if (retainAsPublished)
    opts |= 0x08;
  opts |= ((retainHandling & 0x03) << 4);
  body[bpos++] = opts;

  _buffer[0] = MQTT_SUBSCRIBE;
  int encLen = encodeLength(&_buffer[1], (uint32_t)bpos);
  int bodyOff = 1 + encLen;
  if (bodyOff != 5)
    memmove(&_buffer[bodyOff], &_buffer[5], bpos);
  int totalLen = bodyOff + bpos;
  return sendPacket(_buffer, totalLen) == totalLen;
}

bool ESP32_MQTTv5::unsubscribe(const String &topic) {
  if (!connected())
    return false;
  if ((size_t)topic.length() > _bufferSize - 10)
    return false;

  uint8_t *body = _buffer + 5;
  int bodyMax = _bufferSize - 5;
  int bpos = 0;

  uint16_t packetId = getNextPacketId();
  body[bpos++] = (packetId >> 8) & 0xFF;
  body[bpos++] = packetId & 0xFF;

  body[bpos++] = 0x00;

  uint16_t tl = (uint16_t)topic.length();
  if (bpos + 2 + tl > bodyMax)
    return false;
  body[bpos++] = (tl >> 8) & 0xFF;
  body[bpos++] = tl & 0xFF;
  memcpy(&body[bpos], topic.c_str(), tl);
  bpos += tl;

  _buffer[0] = MQTT_UNSUBSCRIBE;
  int encLen = encodeLength(&_buffer[1], (uint32_t)bpos);
  int bodyOff = 1 + encLen;
  if (bodyOff != 5)
    memmove(&_buffer[bodyOff], &_buffer[5], bpos);
  int totalLen = bodyOff + bpos;
  return sendPacket(_buffer, totalLen) == totalLen;
}

int ESP32_MQTTv5::buildAuth(uint8_t *buf, int bufSize, MQTTReasonCode reason,
                            MQTTProperties *props) {
  if (!buf || bufSize < 4)
    return -1;

#define BA_NEED(pos, n)                                                        \
  do {                                                                         \
    if ((pos) + (n) > bufSize)                                                 \
      return -1;                                                               \
  } while (0)

  int propLen = 0;
  uint8_t *propBuf = nullptr;
  if (props && props->count() > 0) {
    propBuf = (uint8_t *)malloc(bufSize);
    if (!propBuf)
      return -1;
    propLen = props->serialize(propBuf, bufSize);
    if (propLen < 0) {
      free(propBuf);
      return -1;
    }
  }

  int encPropBytes = 1;
  if (propLen > 127)
    encPropBytes = 2;
  if (propLen > 16383)
    encPropBytes = 3;
  uint32_t remLenVal = (uint32_t)(1 + encPropBytes + propLen);

  uint8_t remLenBuf[4];
  int encRemLen = encodeLength(remLenBuf, remLenVal);

  int totalNeeded = 1 + encRemLen + 1 + encPropBytes + propLen;
  if (totalNeeded > bufSize) {
    if (propBuf)
      free(propBuf);
    return -1;
  }

  int pos = 0;
  buf[pos++] = MQTT_AUTH;
  memcpy(&buf[pos], remLenBuf, encRemLen);
  pos += encRemLen;
  buf[pos++] = (uint8_t)reason;
  pos += encodeLength(&buf[pos], (uint32_t)propLen);
  if (propLen > 0) {
    memcpy(&buf[pos], propBuf, propLen);
    pos += propLen;
  }

  if (propBuf)
    free(propBuf);

#undef BA_NEED
  return pos;
}

bool ESP32_MQTTv5::sendAuth(MQTTReasonCode reason, MQTTProperties &props) {
  if (!_buffer)
    return false;
  int len = buildAuth(_buffer, _bufferSize, reason, &props);
  if (len < 0)
    return false;
  return sendPacket(_buffer, len) == len;
}

void ESP32_MQTTv5::auth(MQTTReasonCode reason, MQTTProperties &props) {
  sendAuth(reason, props);
}
